app/controllers/events_controller.rb

	def show
		@event = Event.find(params[:id])
		@u = User.find(Event.find(params[:id]).admin_id)
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]

	def create
		date = "#{params[:j].to_s} #{params[:h].to_s}"
		date = date.to_time
		@event = Event.new(title: params[:title], description: params[:description], location: params[:location], duration: params[:duration], price: params[:price], start_date: date, admin_id: current_user.id)
		if @event.save
---
INSERT INTO "events" ("title", "location", "description", "start_date", "duration", "price", "admin_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"